{
  "backend/main.mo": "Motoko backend defining note/file types, paywall state, access control, and admin/user functions for managing paywall status.",
  "feature_evidence.json": "Feature evidence report mapping deployment-related features to files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Collection of short summaries describing each major frontend file and its functionality.",
  "frontend/deploy-logs/.gitkeep": "Empty file ensuring the deploy-logs directory is tracked in version control.",
  "frontend/DEPLOYMENT_IC.md": "Mainnet deployment guide with prerequisites, quick-start steps, and instructions for running the deployment script.",
  "frontend/index.css": "Tailwind CSS global styles defining theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML entry point loading the frontend app via main.tsx.",
  "frontend/scripts/deploy-ic.sh": "Mainnet deployment script handling preflight checks, build, canister creation, installation, logging, and error troubleshooting.",
  "frontend/src/App.tsx": "Root React component managing authentication, actor initialization, profile loading, and conditional rendering of vault UI.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access-denied screen prompting the user to authenticate with Internet Identity.",
  "frontend/src/components/auth/InitializationErrorScreen.tsx": "Shows an initialization failure message with error details and a retry button.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button handling Internet Identity authentication and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for entering and saving a user's display name during initial profile setup.",
  "frontend/src/components/common/ErrorBanner.tsx": "Reusable banner component for displaying error titles and messages.",
  "frontend/src/components/files/FileDetailPanel.tsx": "Panel for viewing, editing metadata, downloading, and deleting an individual file.",
  "frontend/src/components/files/FilePreviewPanel.tsx": "Displays decrypted previews for supported file types and allows editing, downloading, and deleting.",
  "frontend/src/components/files/FilesListPanel.tsx": "Lists all files with ownership badges and allows selecting a file for viewing.",
  "frontend/src/components/files/FileUploadCard.tsx": "Card for encrypted file upload with drag‑and‑drop support, progress tracking, and storage-access gating.",
  "frontend/src/components/layout/VaultLayout.tsx": "Main vault layout managing tabs, note/file panels, paywall states, and an admin access-list view.",
  "frontend/src/components/notes/NoteDetailPanel.tsx": "Displays and edits a selected note with client-side encryption, saving, deletion, and sharing features.",
  "frontend/src/components/notes/NotesListPanel.tsx": "Lists user notes, shows sharing status, and provides a dialog to create encrypted notes if storage access is enabled.",
  "frontend/src/components/paywall/PaywallPanel.tsx": "Shows paywall restrictions, plan details, and expiration when storage access is unavailable.",
  "frontend/src/components/settings/AdminPaywallAccessListScreen.tsx": "Admin screen listing all paywall states with options to revoke access and copy principals.",
  "frontend/src/components/settings/EncryptionToggle.tsx": "Toggle component enabling or disabling client-side encryption with descriptive status messaging.",
  "frontend/src/components/settings/PaywallAdminPanel.tsx": "UI panel showing the caller’s paywall status and, if admin, controls to grant or revoke paywall access for other principals.",
  "frontend/src/components/sharing/ShareManagerDialog.tsx": "Dialog for sharing an item with other principals, allowing adding or revoking access via provided mutations.",
  "frontend/src/hooks/encryption/useEncryptionSettings.ts": "Hook managing user-specific encryption settings and providing content and file encrypt/decrypt helpers.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching a backend actor tied to the current identity, reinitializing on identity changes.",
  "frontend/src/hooks/useCurrentIdentity.ts": "Hook exposing the authenticated principal, identity object, and a logout function that clears cached data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity auth state, login flow, stored identities, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, paywall status, admin paywall state, and access mutations.",
  "frontend/src/hooks/useSafeActor.ts": "Hook creating an authenticated backend actor with timeout protection and returning its load state and errors.",
  "frontend/src/index.css": "Tailwind base setup with custom CSS variables defining light and dark theme colors and global styles.",
  "frontend/src/lib/crypto/vaultCrypto.ts": "Implements AES‑GCM key generation, encryption, and decryption utilities for text and file bytes with base64 helpers.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/async.ts": "Provides a utility to wrap promises with a timeout using Promise.race.",
  "frontend/src/utils/filePreview.ts": "Detects file preview types, resolves MIME types, and checks browser video playback capability.",
  "frontend/src/utils/paywall.ts": "Utilities for evaluating paywall status, formatting expiration dates, and converting storage sizes.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, custom colors bound to CSS variables, and plugins.",
  "project_state.json": "Tracks project metadata, architecture notes, issues, and implemented features for the secure vault app."
}