{
  "backend/main.mo": "Defines note and file types, access control, storage mixins, and paywall logic including admin functions to manage user paywall status.",
  "feature_evidence.json": "Lists implemented features with related files, components, test IDs, and confidence ratings for preview and file handling capabilities.",
  "frontend-file-summaries.txt": "Provides short summaries of major frontend source files including components, hooks, crypto utilities, and deployment scripts.",
  "frontend/deploy-logs/.gitkeep": "Placeholder file ensuring the deploy-logs directory is committed.",
  "frontend/DEPLOYMENT_IC.md": "Documentation explaining how to deploy the app to IC mainnet with prerequisites and basic deployment steps.",
  "frontend/index.css": "Tailwind-based global CSS defining design tokens and light/dark theme variables for the app.",
  "frontend/index.html": "Base HTML page containing the root element and script loader for the frontend app.",
  "frontend/scripts/deploy-ic.sh": "Shell script that builds and deploys backend and frontend canisters to IC mainnet with logging and error handling.",
  "frontend/src/App.tsx": "Main React app component handling authentication, actor initialization, profile loading, error screens, and rendering the vault layout.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an authentication prompt with Internet Identity login for users denied access.",
  "frontend/src/components/auth/InitializationErrorScreen.tsx": "Shows an initialization failure message with error details and a retry button.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button tied to Internet Identity with handling for auth states and errors.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for entering and saving a user's name during initial profile setup.",
  "frontend/src/components/common/ErrorBanner.tsx": "Generic error alert component displaying a title and message.",
  "frontend/src/components/files/FileDetailPanel.tsx": "Panel for viewing, editing, downloading, and deleting file metadata and content.",
  "frontend/src/components/files/FilePreviewPanel.tsx": "Displays file previews by decrypting content and supports editing, downloading, and deleting.",
  "frontend/src/components/files/FilesListPanel.tsx": "Lists user files with badges and allows selecting a file for detailed viewing.",
  "frontend/src/components/files/FileUploadCard.tsx": "Upload widget supporting drag-and-drop, encryption, and progress tracking, gated by storage access.",
  "frontend/src/components/layout/VaultLayout.tsx": "Main layout controlling vault and admin-access views, handling tabs, selected items, identity, and paywall status to show notes, files, or admin screens.",
  "frontend/src/components/notes/NoteDetailPanel.tsx": "Displays and edits a selected note with encryption support, allowing save, delete, and sharing actions with loading and error states.",
  "frontend/src/components/notes/NotesListPanel.tsx": "Lists user notes, shows ownership or sharing status, and provides a dialog to create new encrypted notes if storage access is enabled.",
  "frontend/src/components/paywall/PaywallPanel.tsx": "Shows a locked-access panel explaining paywall restrictions and displays plan and expiration info when available.",
  "frontend/src/components/settings/AdminPaywallAccessListScreen.tsx": "Admin screen listing all users with storage access, supporting copying principals and revoking paywall permissions.",
  "frontend/src/components/settings/EncryptionToggle.tsx": "Provides a switch to enable or disable client-side encryption with explanatory text on each state.",
  "frontend/src/components/settings/PaywallAdminPanel.tsx": "Admin and user paywall panel showing current status and allowing admins to grant or revoke access via mutations.",
  "frontend/src/components/sharing/ShareManagerDialog.tsx": "Dialog for sharing or revoking access to a note or file by entering principal IDs and showing current shared users.",
  "frontend/src/hooks/encryption/useEncryptionSettings.ts": "Hook managing per-user encryption settings and providing helpers to encrypt or decrypt text and file bytes.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous backend actor and refreshes dependent queries on identity change.",
  "frontend/src/hooks/useCurrentIdentity.ts": "Hook exposing the current identity, authentication state, principal string, and logout function.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provider and hook managing Internet Identity login, stored identities, and status through AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for user profiles, paywall statuses, admin paywall management, and share/revoke operations.",
  "frontend/src/hooks/useSafeActor.ts": "Hook creating an authenticated backend actor with timeout handling and returning safe actor state for queries.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark theme CSS variables for colors, radius, and base styles.",
  "frontend/src/lib/crypto/vaultCrypto.ts": "Implements AES‑GCM encryption/decryption for text and file bytes, plus key generation and base64 utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, importing global CSS.",
  "frontend/src/utils/async.ts": "Provides a helper that wraps a promise with a timeout using Promise.race.",
  "frontend/src/utils/filePreview.ts": "Detects file types, returns MIME types, and checks video playability for previews.",
  "frontend/src/utils/paywall.ts": "Calculates paywall state, formats expiration dates, and formats storage sizes from bigint values.",
  "frontend/src/utils/urlParams.ts": "Handles URL and sessionStorage parameter retrieval, persistence, and cleanup for routing contexts.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom color tokens, radius, animations, and plugin integrations.",
  "project_state.json": "Describes project goals, architecture notes, issues, and implemented features for the secure notes/files app."
}