{
  "kind": "build_request",
  "title": "Make mainnet deployments re-runnable and persist resulting canister IDs for retrieval",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-42",
      "text": "Update the mainnet deployment script (`frontend/scripts/deploy-ic.sh`) to persist the resulting **backend canister ID** and **frontend canister ID** to a stable, machine-readable artifact inside the repo (e.g., a JSON file under `frontend/deploy-logs/`) on every successful deployment, so the IDs can be retrieved later without needing console output.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ok pls trigger another deployment"
        ]
      },
      "acceptanceCriteria": [
        "After a successful run of `frontend/scripts/deploy-ic.sh`, a deterministic file (same path on every run) exists under `frontend/deploy-logs/` containing at minimum: backend canister ID, frontend canister ID, deployment timestamp, and the computed frontend URL.",
        "The script continues to print the canister IDs to stdout as it currently does, and also writes the same values to the artifact file.",
        "If the script cannot determine either canister ID at the end of deployment, it does not overwrite the last-known-good artifact file and prints a clear warning explaining how to retrieve IDs manually (`dfx canister id ... --network ic`)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Do not introduce any external services or CI/CD dependencies; the deployment flow must remain runnable via local `dfx`.",
    "Keep all backend logic within the existing single Motoko actor (no new backend canisters/services)."
  ],
  "nonGoals": [
    "Building an in-app UI to trigger deployments from the browser.",
    "Automatically deploying from within Caffeine/Chat (this build request only changes project code/scripts).",
    "Changing backend data models or adding new product features unrelated to deployment ID retrieval."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}