{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Reliable IC mainnet deployment script output, verification, and documentation",
  "requirements": [
    {
      "id": "REQ-39",
      "summary": "Make the IC mainnet deploy script perform a fresh end-to-end deployment by ensuring mainnet canisters exist before install/upgrade, with clear actionable failures and logged step output.",
      "acceptanceCriteria": [
        "Running `frontend/scripts/deploy-ic.sh` on a clean mainnet setup (no canisters created yet) creates required canisters on `--network ic` and then installs them successfully, or exits with a clear error message indicating which step failed (create/build/install) and why.",
        "The script no longer relies solely on `dfx canister install ...` for first-time deployment; it performs the necessary canister creation step(s) when the canister does not yet exist on mainnet.",
        "The script continues to write a timestamped log file under `frontend/deploy-logs/` and includes the failing step name and captured `dfx` output on failure."
      ],
      "file_operations": [
        {
          "path": "frontend/scripts/deploy-ic.sh",
          "operation": "modify",
          "description": "Update the deployment flow to be truly fresh on `--network ic`: add an explicit canister-existence check and creation step(s) for backend and frontend before attempting install/upgrade; split into deterministic steps (e.g., PREFLIGHT/BUILD/CREATE/INSTALL_BACKEND/INSTALL_FRONTEND); on any failure, print and log a clear actionable error that includes the failing step name and the captured `dfx` output (including common causes like insufficient cycles and controller mismatch), while preserving the timestamped log behavior under `frontend/deploy-logs/`."
        }
      ]
    },
    {
      "id": "REQ-40",
      "summary": "Always print and log backend/frontend canister IDs from mainnet plus a deterministic post-deploy verification section to confirm backend reachability.",
      "acceptanceCriteria": [
        "On success, the script prints and logs: `Backend Canister ID: ...` and `Frontend Canister ID: ...` (as it does today) and additionally prints a short ‘Verify’ section containing at least: `dfx canister status backend --network ic` and a backend reachability hint (e.g., an ic0.app/raw.ic0.app URL pattern) without requiring the user to guess what to check.",
        "The printed IDs are retrieved from `dfx` in a way that reflects the actual deployed canisters on `--network ic` (not local), and the output is present in the log file as well as stdout."
      ],
      "file_operations": [
        {
          "path": "frontend/scripts/deploy-ic.sh",
          "operation": "modify",
          "description": "Enhance success output to reliably retrieve canister IDs from `dfx` for `--network ic` after deployment and print+log them in a stable format. Add a deterministic 'Verify' section that is also logged, including at minimum `dfx canister status backend --network ic` and a concrete backend reachability hint using the resolved backend canister ID (e.g., an `ic0.app`/`raw.ic0.app` URL pattern), ensuring users can validate 'deployed + reachable' without guessing."
        }
      ]
    },
    {
      "id": "REQ-41",
      "summary": "Expand the IC mainnet deployment documentation with complete copy-pastable steps and targeted troubleshooting for 'canister not found' and IC0508 'canister is stopped'.",
      "acceptanceCriteria": [
        "`frontend/DEPLOYMENT_IC.md` includes the exact command(s) to run from the project root to deploy to `--network ic` (including invoking `frontend/scripts/deploy-ic.sh`).",
        "The guide documents how to obtain and record the backend and frontend canister IDs after deployment, and how to verify them using `dfx` commands.",
        "The troubleshooting section explicitly addresses: (1) NNS ‘canister not found’ when linking an ID, and (2) IC0508 ‘canister is stopped’ errors in the app, and provides concrete verification steps to distinguish ‘not deployed’, ‘stopped’, and ‘wrong network’ cases."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT_IC.md",
          "operation": "modify",
          "description": "Complete the guide with full, copy-pastable mainnet deployment steps from project root, explicitly including running `frontend/scripts/deploy-ic.sh`. Document where to read the deploy log, how to obtain/record backend and frontend canister IDs (using `dfx ... --network ic`), and include a verification section with concrete `dfx` status commands and reachability checks. Add a focused troubleshooting section for (1) NNS 'canister not found' when linking an ID and (2) IC0508 'canister is stopped', including steps to distinguish 'not deployed', 'stopped', and 'wrong network' using `dfx` commands."
        }
      ]
    }
  ]
}