{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Persist mainnet deployment canister IDs for later retrieval",
  "requirements": [
    {
      "id": "REQ-42",
      "summary": "Persist backend/frontend canister IDs and deployment metadata to a deterministic JSON artifact after successful mainnet deployment.",
      "acceptanceCriteria": [
        "After a successful run of `frontend/scripts/deploy-ic.sh`, a deterministic file (same path on every run) exists under `frontend/deploy-logs/` containing at minimum: backend canister ID, frontend canister ID, deployment timestamp, and the computed frontend URL.",
        "The script continues to print the canister IDs to stdout as it currently does, and also writes the same values to the artifact file.",
        "If the script cannot determine either canister ID at the end of deployment, it does not overwrite the last-known-good artifact file and prints a clear warning explaining how to retrieve IDs manually (`dfx canister id ... --network ic`)."
      ],
      "file_operations": [
        {
          "path": "frontend/scripts/deploy-ic.sh",
          "operation": "modify",
          "description": "Add logic to write a stable, machine-readable deployment artifact JSON (deterministic path under frontend/deploy-logs/, e.g. frontend/deploy-logs/ic-latest.json) on successful deployments. Capture backend canister ID, frontend canister ID, deployment timestamp (ISO-8601 recommended), and computed frontend URL; ensure the script still prints IDs/URLs to stdout as it does today. Implement a safe-write strategy (write to a temp file then atomically move) and explicitly avoid overwriting the last-known-good artifact when either canister ID cannot be determined; in that case, print a clear warning including the manual retrieval commands (`dfx canister id backend --network ic` and `dfx canister id frontend --network ic`)."
        },
        {
          "path": "frontend/deploy-logs/ic-latest.json",
          "operation": "create",
          "description": "Add a tracked placeholder/example deployment artifact JSON file (or minimal seed file) at a deterministic path used by the script, so the expected artifact path exists in-repo and is easy to discover. The deploy script should overwrite/update this file only on successful ID extraction."
        },
        {
          "path": "frontend/DEPLOYMENT_IC.md",
          "operation": "modify",
          "description": "Update the mainnet deployment guide to document the deterministic deployment artifact file location under frontend/deploy-logs/ (including what fields it contains and that it updates on every successful run), and mention the manual `dfx canister id ... --network ic` commands used when IDs cannot be determined."
        }
      ]
    }
  ]
}